tap "homebrew/cask"
tap "homebrew/bundle"
cask_args appdir: "/Applications"

###  tools ###
brew "mas"
brew "jq"
brew "tree"
brew "curl"
brew "grep"
brew "git"
brew "goenv"
cask "clipy"
cask "the-unarchiver"
cask "appcleaner"
cask "bettertouchtool"
cask "google-japanese-ime" # dependency on `sudo softwareupdate --install-rosetta`
cask "karabiner-elements"
###  communication ###
cask "discord"
cask "zoom"
cask "slack"
###  other ###
cask "spotify"
###  browser ###
cask "brave-browser"
cask "google-chrome"
### developer tools ###
cask "goland"
# cask "phpstorm"
cask "tableplus"
cask "postman"
cask "visual-studio-code"
cask "charles"
cask "docker"
cask "iterm2"

###  personal ###
cask "notion"
cask "asana"
cask "figma"
cask "evernote"
cask "dropbox"
cask "microsoft-excel"
cask "microsoft-word"
cask "microsoft-outlook"
cask "microsoft-powerpoint"
cask "onedrive"
mas "LINE", id: 539883307
mas "NAS Navigator2", id: 450664466
mas "BetterSnapTool", id: 417375580
mas "QaLL", id: 480452005
