tap "homebrew/bundle"
tap "kayac/tap" # for ecspresso
tap "ariga/tap" # for atlas
cask_args appdir: "/Applications"

###  tools ###
brew "mas"
brew "jq"
brew "tree"
brew "curl"
brew "grep"
brew "ffmpeg"
brew "tcl-tk"
brew "mysql-client"
brew "mkcert"
brew "nss"
brew "switchaudio-osx"
cask "session-manager-plugin"
cask "clipy"
cask "the-unarchiver"
cask "appcleaner"
cask "bettertouchtool"
cask "google-japanese-ime" # dependency on `sudo softwareupdate --install-rosetta`
cask "karabiner-elements"
cask "1password"
###  communication ###
cask "discord"
cask "slack"
###  other ###
cask "spotify"
cask "vlc"
###  browser ###
cask "google-chrome"
### developer tools ###
cask "goland"
cask "visual-studio-code"
cask "cursor"
cask "charles"
cask "docker"
cask "iterm2"
brew "git"
brew "goenv", args: ["HEAD"]
brew "ctop"
brew "tfenv"
brew "awscli"
brew "ecspresso"
brew "atlas"
brew "nodenv"
cask "ngrok"

###  personal ###
cask "notion"
cask "evernote"
cask "dropbox"
cask "microsoft-excel"
cask "microsoft-word"
cask "microsoft-outlook"
cask "microsoft-powerpoint"
cask "onedrive"
mas "LINE", id: 539883307
mas "BetterSnapTool", id: 417375580
mas "QaLL", id: 480452005